doom.d/config.org
# Created 2023-05-29 Mon 15:35
#+title: Celibistrial's DOOM Emacs config
#+AUTHOR: Gaurav Choudhury
#+property: header-args:emacs-lisp :tangle yes :cache yes :results silent :padline no
* Table of contents :toc_3:
- [[#my-doom-config][My doom config]]
  - [[#doom-helper-functions][doom helper functions]]
  - [[#auto-revert][auto revert]]
  - [[#setting-doom--evil-variables][Setting doom & evil variables]]
  - [[#fonts][fonts]]
  - [[#clipboard][clipboard]]
  - [[#vertico][vertico]]
  - [[#smartparens][smartparens]]
  - [[#tree-sitter][tree-sitter]]
  - [[#languages][languages]]
    - [[#lsp-ui][lsp-ui]]
    - [[#lsp-nix][lsp-nix]]
    - [[#cc][C/C++]]
  - [[#org][org]]
    - [[#general][general]]
    - [[#org-roam][org-roam]]
    - [[#org-download][org-download]]
    - [[#easy-export-with-css][easy export with css]]
    - [[#org-capture][org-capture]]
    - [[#encryption][encryption]]
    - [[#speech-to-text][speech to text]]
    - [[#org-media-notes][org media notes]]
    - [[#org-timeblock][org-timeblock]]
    - [[#org-hyperscheduler][org-hyperscheduler]]
    - [[#custom-org-functions][custom org functions]]
    - [[#org-timeblock-1][org-timeblock]]
    - [[#org-excalidraw][org-excalidraw]]
    - [[#org-web-tools][org-web-tools]]
    - [[#org-frag-tog][org-frag-tog]]
    - [[#ox-hugo][ox-hugo]]
    - [[#org-yasnippet][org yasnippet]]
  - [[#spell-check][spell check]]
  - [[#gptel][gptel]]
  - [[#affe][affe]]
  - [[#fuzzy-finder][fuzzy-finder]]
  - [[#gocryptfs][gocryptfs]]
  - [[#ediff][ediff]]
  - [[#markdown][markdown]]
  - [[#emacs-29-shenanigans][emacs 29 shenanigans]]
  - [[#activity-watch-mode-activity-watcher][activity-watch-mode (activity watcher)]]
  - [[#iscrollel][iscroll.el]]

* My doom config
** doom helper functions
#+begin_src emacs-lisp
(defun doom/ediff-init-and-example ()
  "ediff the current `init.el' with the example in doom-emacs-dir"
  (interactive)
  (ediff-files (concat doom-private-dir "init.el")
               (concat doom-emacs-dir "templates/init.example.el")))

(define-key! help-map
  "di"   #'doom/ediff-init-and-example
  )


#+end_src
** auto revert
#+begin_src emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src
** Setting doom & evil variables
#+begin_src emacs-lisp
(setq user-full-name "Gaurav Choudhury"
      user-mail-address "gauravchoudhury80222@gmail.com")
(setq doom-theme 'doom-vibrant)


;;(custom-set-faces!
;;  '(font-lock-variable-name-face :foreground ,(doom-color 'white)))
(setq display-line-numbers-type t)
(setq select-enable-clipboard nil)
;; (use-package-hook! evil
;;   :pre-init
;;   (setq evil-respect-visual-line-mode t) ;; sane j and k behavior
;;   t)

#+end_src
** fonts
Doom exposes five (optional) variables for controlling fonts in Doom:

- `doom-font' -- the primary font to use
- `doom-variable-pitch-font' -- a non-monospace font (where applicable)
- `doom-big-font' -- used for `doom-big-font-mode'; use this for
  presentations or streaming.
- `doom-symbol-font' -- for symbols
- `doom-serif-font' -- for the `fixed-pitch-serif' face

See 'C-h v doom-font' for documentation and more examples of what they
accept. For example:

setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
     doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))

If you or Emacs can't find your font, use 'M-x describe-font' to look them
up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
refresh your font settings. If Emacs still can't find your font, it likely
wasn't installed correctly. Font issues are rarely Doom issues!
#+begin_src emacs-lisp
;; Emoji: 😄, 🤦, 🏴󠁧󠁢󠁳󠁣󠁴󠁿
;; (set-fontset-font t 'symbol "Apple Color Emoji")
;; (set-fontset-font t 'symbol "Noto Color Emoji" nil 'append)
;; (set-fontset-font t 'symbol "Segoe UI Emoji" nil 'append)
;; (set-fontset-font t 'symbol "Symbola" nil 'append)
;; (set-fontset-font t 'symbol "Segoe UI Emoji" nil 'append)
;; (setq emojify-display-style "unicode")
;; (setq vterm-font "JetBrainsMono Nerd Font:size=12")

#+end_src
** clipboard
#+begin_src emacs-lisp
(defun copy-current-line-to-clipboard ()
  "Copy the current line to the system clipboard."
  (interactive)
  (save-excursion
    (back-to-indentation)
    (set-mark (line-end-position))
    (copy-region-as-kill (point) (mark)))
  (clipboard-kill-ring-save (region-beginning) (region-end))
  (message "Line copied to clipboard"))

(map!
 :leader
 :nv
 :desc "Copy line to system clipboard" "Y" #'copy-current-line-to-clipboard)
(map!
 :leader
 :nv
 :desc "Copy to system clipboard" "y" #'clipboard-kill-ring-save)

(map!
 "C-S-v" #'clipboard-yank)
(map!
 "C-S-c" #'clipboard-kill-ring-save)

(map!
 :leader
 :nv
 "z" #'comint-dynamic-complete-filename)


#+end_src
** vertico
#+begin_src emacs-lisp
(setq projectile-indexing-method 'alien)
(map!
 :leader
 :nv
 "C-v" #'consult-yank-from-kill-ring)
(setq projectile-enable-caching t)
#+end_src
** smartparens
#+begin_src emacs-lisp
(after! smartparens
  (smartparens-mode 1)
  (smartparens-global-mode 1))
#+end_src
** tree-sitter
#+begin_src emacs-lisp
(setq +tree-sitter-hl-enabled-modes t)
#+end_src
** languages
*** lsp-ui
#+begin_src emacs-lisp
(after! lsp-ui
  (setq lsp-ui-sideline-show-code-actions   nil)
  (setq lsp-headerline-breadcrumb-enable nil)
  (setq lsp-enable-symbol-highlighting t)
  (setq lsp-signature-auto-activate t)
  (setq lsp-ui-sideline-enable t)
  (setq lsp-eldoc-enable-hover t)
  (setq lsp-completion-show-detail t)
 (setq lsp-signature-auto-activate nil)
  (setq lsp-completion-show-kind t))
 (setq lsp-auto-guess-root t)
(defun lsp-ui-sideline--compute-height nil '(height unspecified))

(setq doom-modeline-env-version t)
(setq doom-modeline-time t)
#+end_src
*** lsp-nix
#+begin_src emacs-lisp
 (set-formatter! 'alejandra '("alejandra" "--quiet") :modes '(nix-mode))
;; (use-package! lsp-nix
  ;; :custom (lsp-nix-nil-formatter ["alejandra" "--quiet"]))
 (use-package! nix-mode
   :custom (nix-nixfmt-bin "~/.dotconfigs/scripts/alejandra-the-quiet.sh" ))
#+end_src
*** C/C++
#+begin_src emacs-lisp
 ;; (custom-set-faces!
 ;;   `(font-lock-variable-name-face :foreground ,(doom-color 'white) )
 ;;   `(font-lock-builtin-face :foreground ,(doom-color 'yellow)  )
 ;;   `(font-lock-function-name-face :foreground ,(doom-color 'blue) :weight bold)
 ;;   )
#+end_src
** org
*** general
#+begin_src emacs-lisp
(setq org-log-done 'time)
(after! org
  (add-to-list 'org-modules 'org-habit)
 ;; (setq org-agenda-files (directory-files-recursively "~/org/" "\\.org$"))

  (setq org-directory "~/org/")
  (setq org-attach-id-dir "data/")
  )

(defun org-toggle-emphasis ()
  "Toggle hiding/showing of org emphasize markers."
  (interactive)
  (if org-hide-emphasis-markers
      (set-variable 'org-hide-emphasis-markers nil)
    (set-variable 'org-hide-emphasis-markers t))
  (org-mode-restart))
;; (define-key org-mode-map (kbd "C-c e") 'org-toggle-emphasis)

(map!
 :map org-mode-map
 "C-c e" #'org-toggle-emphasis)
#+end_src
*** org-roam
#+begin_src emacs-lisp
(after! org-roam
  (setq org-roam-capture-ref-templates
        '(("w" "ref" plain "%(org-web-tools--url-as-readable-org \"${ref}\")"
           :target (file+head "clips/${slug}.org" "#+title: ${title}\n")
           :unnarrowed t)))
  (setq org-roam-db-node-include-function
        (lambda ()
          (not (member "ATTACH" (org-get-tags)))))
  (setq org-roam-capture-templates
        '(
          ("d" "default" plain "%?" :target
           (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+FILETAGS:  :%<%Y-%m-%d>:\n ")
           :unnarrowed t)
          )
        )
  (setq org-roam-dailies-capture-templates '(("d" "default" entry "* %<%r> %?"
					      :target
					      (file+head "%<%Y-%m-%d>.org" "#+title: %<%A %Y-%m-%d>\n#+FILETAGS:  :%<%Y-%m-%d>: "))))
  )
#+end_src
*** org-download
#+begin_src emacs-lisp
(after! org
(use-package! org-download))

#+end_src
*** easy export with css
#+begin_src emacs-lisp
;; put your css files there
(defvar org-theme-css-dir "~/.config/doom/css/")

(defun toggle-org-custom-inline-style ()
  (interactive)
  (let ((hook 'org-export-before-parsing-hook)
        (fun 'set-org-html-style))
    (if (memq fun (eval hook))
        (progn
          (remove-hook hook fun 'buffer-local)
          (messag       e "Removed %s from %s" (symbol-name fun) (symbol-name hook)))
      (add-hook hook fun nil 'buffer-local)
      (message "Added %s to %s" (symbol-name fun) (symbol-name hook)))))

(defun org-theme ()
  (interactive)
  (let* ((cssdir org-theme-css-dir)
         (css-choices (directory-files cssdir nil ".css$"))
         (css (completing-read "theme: " css-choices nil t)))
    (concat cssdir css)))

(defun org-export-style (&optional backend)
  (interactive)
  (when (or (null backend) (eq backend 'html))
    (let ((f (or (and (boundp 'org-theme-css) org-theme-css) (org-theme))))
      (if (file-exists-p f)
          (progn
            (set (make-local-variable 'org-theme-css) f)
            (set (make-local-variable 'org-html-head)
                 (with-temp-buffer
                   (insert "<style type=\"text/css\">\n<!--/*--><![CDATA[/*><!--*/\n")
                   (insert-file-contents f)
                   (goto-char (point-max))
                   (insert "\n/*]]>*/-->\n</style>\n")
                   (buffer-string)))
            (set (make-local-variable 'org-html-head-include-default-style)
                 nil)
            (message "Set custom style from %s" f))
        (message "Custom header file %s doesnt exist")))))
#+end_src
