doom.d/config.org
*** org-capture
#+begin_src emacs-lisp
(defun org-random-choice (file)
  "Return a random line from FILE."
  (with-temp-buffer
    (insert-file-contents file)
    (let ((lines (split-string (buffer-string) "\n" t)))
      (nth (random (length lines)) lines))))

(after! org
  (setq org-capture-templates
        '(("x" "Quick note" entry (file+headline "~/org/refile.org" "TEMP") "** %? " )
          ("t" "Personal todo" entry (file+headline "~/org/refile.org" "TODOS") "** TODO %?")
          ("w" "Workout Journal" entry (file "~/org/workout journal.org") "* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n ")
          ("n" "Personal notes" entry (file+headline "~/org/refile.org" "NOTES") "* %u %?\n%i %a" :prepend t)
          ("j" "Journal Entry" entry
           (file+olp+datetree "~/org/journal.org.gpg")
           "* %<%H:%M> \n%?")
          ("J" "Journal Entry With Prompt" entry
           (file+olp+datetree "~/org/journal.org.gpg")
           "* %<%H:%M> \n** Prompt:%(org-random-choice \"~/org/journaling_prompts.org\")  \n%?")
          ("p" "Templates for projects") ("pt" "Project-local todo" entry (file+headline +org-capture-project-todo-file "Inbox") "* TODO %?
%i
%a" :prepend t) ("pn" "Project-local notes" entry (file+headline +org-capture-project-notes-file "Inbox") "* %U %?
%i
%a" :prepend t) ("pc" "Project-local changelog" entry (file+headline +org-capture-project-changelog-file "Unreleased") "* %U %?
%i
%a" :prepend t) ("o" "Centralized templates for projects") ("ot" "Project todo" entry #'+org-capture-central-project-todo-file "* TODO %?
 %i
 %a" :heading "Tasks" :prepend nil) ("on" "Project notes" entry #'+org-capture-central-project-notes-file "* %U %?
 %i
 %a" :heading "Notes" :prepend t) ("oc" "Project changelog" entry #'+org-capture-central-project-changelog-file "* %U %?
 %i
 %a" :heading "Changelog" :prepend t))
        )
  )
#+end_src
*** encryption
#+begin_src emacs-lisp
(after! epa
  (setq epa-file-encrypt-to "82810795+Celibistrial@users.noreply.github.com")
 (setq epg-pinentry-mode 'loopback)
  )
(after! org-crypt
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance '("crypt"))

  (setq org-crypt-key "82810795+Celibistrial@users.noreply.github.com")
  ;; GPG key to use for encryption.
  ;; nil means  use symmetric encryption unconditionally.
  ;; "" means use symmetric encryption unless heading sets CRYPTKEY property.

  (setq auto-save-default nil)
  )
(map! "C-x <f12>" #'org-decrypt-entries)
(map! "C-x <f11>" #'org-decrypt-entry)
#+end_src
*** speech to text
#+begin_src emacs-lisp
(use-package whisper
  :config
  (setq whisper-install-directory "~/.cache/whisper/"
        ;; whisper-install-whispercpp nil
        ;; whisper-model "distil-large-v3"
        whisper-model "base"
        whisper-language "en"
        whisper-translate nil
        ))

;; (defun whisper--nix-command (input-file)
;;   `("whisper-cpp"
;;     "--model" ,(expand-file-name (concat "~/data/AI/whisper/" "ggml-" whisper-model ".bin"))
;;     ,@(when whisper-use-threads (list "--threads" (number-to-string whisper-use-threads)))
;;     ,@(when whisper-translate '("--translate"))
;;     ,@(when whisper-show-progress-in-mode-line '("--print-progress"))
;;     "--language" ,whisper-language
;;     "--no-timestamps"
;;     "--file" ,input-file))

;; (advice-add 'whisper-command :override #'whisper--nix-command)
(load-file "~/.config/doom/whisper-custom.el")
#+end_src
*** org media notes
#+begin_src emacs-lisp
(use-package! org-media-note
  :init (setq org-media-note-use-org-ref nil)
  :hook (org-mode .  org-media-note-mode)
  :config
  (setq org-media-note-screenshot-image-dir "~/org/.attach/org-media-images")  ;; Folder to save screenshot
  (setq org-media-note-use-refcite-first t)  ;; use videocite link instead of video link if possible
  )
(setq mpv-default-options '("--ao=alsa"))
(map!
 :leader
 :map org-mode-map
 :nv
 :desc "org media note show interface"
 "i m" #'org-media-note-show-interface
 )
(defun delete-and-remove-hook (file)
  (delete-file file)
  (setq whisper-after-insert-hook nil)

  )
(defun transcribe-and-attach-audio-file ()
  "Ask for an audio file, rename it to the current day date and time, org-attach it, and transcribe it using whisper."
  (interactive)
  (gocryptfs-mount-if-not-mounted)
  (let ((file (expand-file-name (read-file-name "Media file: " (expand-file-name "~/data/Voice Notes/") nil t))))
    (unless (file-readable-p file)
      (error "Media file doesn't exist or isn't readable"))
    (let ((new-file-name (format-time-string "%Y-%m-%d-%H-%M" (current-time))))
      (rename-file file (concat (file-name-directory file) new-file-name "." (file-name-extension file)) t)
      (org-attach-attach (concat (file-name-directory file) new-file-name "." (file-name-extension file)))
      (insert "\n~transcript~\n")
      (insert "#+BEGIN_QUOTE\n\n#+END_QUOTE")
      (forward-line -1)
      (whisper-custom-run (concat (file-name-directory file) new-file-name "." (file-name-extension file)))
      ;; (whisper-custom-run (concat (string-trim (substring (car (cdr (car (org-collect-keywords '("PROPERTY" "ATTACH_DIR"))))) (length "ATTACH_DIR "))) new-file-name "." (file-name-extension file)))
      ;; (delete-file (concat (file-name-directory file) new-file-name "." (file-name-extension file)))
      (add-hook 'whisper-after-insert-hook
                (apply-partially #'delete-and-remove-hook (concat (file-name-directory file) new-file-name "." (file-name-extension file))))


      )))

(map!
 :leader
 :map org-mode-map
 :nv
 :desc "transcribe and attach audio file"
 "i t" #'transcribe-and-attach-audio-file
 )
#+end_src
*** org-timeblock
#+begin_src emacs-lisp
;; (use-package! org-timeblock
;;   :config
;;   (evil-define-key 'normal org-timeblock-mode-map "q" #'org-timeblock-quit)
;;   (evil-define-key 'normal org-timeblock-mode-map "l" #'org-timeblock-day-later)
;;   (evil-define-key 'normal org-timeblock-mode-map "h" #'org-timeblock-day-earlier)
;;   (evil-define-key 'normal org-timeblock-mode-map "j" #'org-timeblock-jump-to-day)
;;   (evil-define-key 'normal org-timeblock-mode-map "v" #'org-timeblock-change-span)
;;   (evil-define-key 'normal org-timeblock-mode-map "s" #'org-timeblock-schedule)
;;   (evil-define-key 'normal org-timeblock-mode-map "d" #'org-timeblock-set-duration)
;;   (evil-define-key 'normal org-timeblock-mode-map "m" #'org-timeblock-mark-block)
;;   (evil-define-key 'normal org-timeblock-mode-map "u" #'org-timeblock-unmark-block)
;;   (evil-define-key 'normal org-timeblock-mode-map "U" #'org-timeblock-unmark-all-blocks)
;;   (evil-define-key 'normal org-timeblock-mode-map "+" #'org-timeblock-new-task)
;;   :custom
;;   (org-timeblock-show-future-repeats t)
;;   :bind
;;   (:map doom-leader-open-map
;;         ("a b" . org-timeblock)))
;; (map!
;;  :leader
;;  :nv
;;  :desc "Open org timeblock"
;;  "o a t" #'org-timeblock)
#+end_src
*** org-hyperscheduler
#+begin_src emacs-lisp

#+end_src
*** custom org functions
#+begin_src emacs-lisp
#+end_src
*** org-timeblock
#+begin_src emacs-lisp
#+end_src
*** org-excalidraw
#+begin_src emacs-lisp
(after! org-excalidraw
  (setq org-excalidraw-directory "~/org/excalidraw"))
#+end_src
*** org-web-tools
#+begin_src emacs-lisp
(use-package! org-web-tools
  :commands org-web-tools--url-as-readable-org)
#+end_src
*** org-frag-tog
#+begin_src emacs-lisp
(after! org
  (add-hook 'org-mode-hook 'org-fragtog-mode)  )
#+end_src
*** ox-hugo
#+begin_src emacs-lisp
;; (use-package! ox-hugo)
;; (after! org
;;   (setq org-hugo-base-dir "~/data/quartz")
;;   (setq org-hugo-front-matter-format "yaml")
;;   (org-hugo-auto-export-mode)
;;   )
#+end_src
*** org yasnippet
#+begin_src emacs-lisp
(map! :map org-mode-map
      :after yasnippet
      ;; Retain org-mode's native TAB functionality but allow yas-expand when a snippet is available
      :nvi [tab]        yas-maybe-expand
      ;; Optionally, bind other keys for snippet navigation
      :nvi "C-c n"      #'yas-next-field
      :nvi "C-c p"      #'yas-prev-field)
#+end_src
** spell check
#+begin_src emacs-lisp
(setq ispell-local-dictionary "en_GB")
#+end_src

** gptel
#+begin_src emacs-lisp
;; (use-package! gptel
;;   :config
;;   (setq!
;;    gptel-model "mistral:7b"
;;    gptel-default-mode #'org-mode
;;    gptel-backend (gptel-make-ollama "Ollama"
;;                    :host "localhost:11434"
;;                    :stream t
;;                    :models '("mistral:7b")))
;;   )
;; (after! gptel
;;   (gptel-make-ollama "Ollama"             ;Any name of your choosing
;;     :host "localhost:11434"               ;Where it's running
;;     :stream t                             ;Stream responses
;;     :models '("llama3:7b"))          ;List of models

;;   )
#+end_src
** affe
#+begin_src emacs-lisp
;; (map!
;;  :leader
;;  :nv
;;  :desc "fuzzy find files" "F" #'affe-find)
#+end_src
** fuzzy-finder
#+begin_src emacs-lisp
(map!
 :leader
 :nv
 :desc "fuzzy find files" "F" #'fuzzy-finder)
#+end_src
** gocryptfs
#+begin_src emacs-lisp
(defvar gocryptfs-ciphertext-dir "~/data/.encrypted"
  "Path to the encrypted directory.")

(defvar gocryptfs-plaintext-dir "~/.prv/"
  "Path to the mount point for the decrypted directory.")

(defun mount-gocryptfs ()
  "Mounts a gocryptfs encrypted directory."
  (interactive)
  (let ((mounted-file (concat gocryptfs-plaintext-dir "/.mounted")))
    (if (file-exists-p mounted-file)
        (if (y-or-n-p (format "%s is already mounted. Unmount and remount? " gocryptfs-plaintext-dir))
            (progn
              (unmount-gocryptfs)
              (let ((password (read-passwd "Enter password: ")))
                (let ((command (format "echo '%s' | gocryptfs %s %s" password gocryptfs-ciphertext-dir gocryptfs-plaintext-dir)))
                  (shell-command command))))
          (message (format "%s is already mounted. Not mounting." gocryptfs-plaintext-dir)))
      (let ((password (read-passwd "Enter password: ")))
        (let ((command (format "echo '%s' | gocryptfs %s %s && touch %s" password gocryptfs-ciphertext-dir gocryptfs-plaintext-dir mounted-file)))
          (shell-command command)
          (run-at-time "30 min" nil 'unmount-gocryptfs)
          )))))

(defun unmount-gocryptfs ()
  "Unmounts a gocryptfs encrypted directory."
  (interactive)
  (let ((command (format "fusermount -u %s" gocryptfs-plaintext-dir)))
    (shell-command command)))

(defun gocryptfs-is-mounted-p ()
  (interactive)
  "Check if the gocryptfs directory is mounted."
  (let ((mounted-file (concat gocryptfs-plaintext-dir "/.mounted")))
    (file-exists-p mounted-file)))

(defun gocryptfs-mount-if-not-mounted ()
  "Mount the gocryptfs directory if it's not already mounted."
  (if (not (gocryptfs-is-mounted-p))
      (let ((password (read-passwd "Enter password: ")))
        (let ((command (format "echo '%s' | gocryptfs %s %s && touch %s" password gocryptfs-ciphertext-dir gocryptfs-plaintext-dir (concat gocryptfs-ciphertext-dir "/.mounted"))))
          (shell-command command)))
    (message "Directory is already mounted.")))
#+end_src
